/**
 * Created by Administrator on 2015/4/25.
 */
    //定义mydata数组 , 用来分段返回值.
var myData = [] ;
//存储数据 , 包括内容为标题 , 图片地址名, 和简介 .
var myDataStr = "1.悬崖村-致贫原因<br>\
<br>\
致贫原因：<br>\
土地贫瘠，交通不便，文化水平低，贫困人口众多，基础设施严重缺位<br>\
<br>\
<br>\
2.悬崖村-脱贫方式<br>\
<br>\
脱贫方式<br>\
政府资金扶贫、易地扶贫搬迁、修路（铁梯）、旅游资源开发综合扶贫<br>\
<br>\
<br>\
3.悬崖村-今昔对比<br>\
<br>\
今昔对比<br>\
人均收入增长7倍，精神状态良好，道路情况改善，全村无缝覆盖信号，电力系统升级<br>\
<br>\
<br>\
4.悬崖村-优秀事迹<br>\
<br>\
优秀事迹<br>\
昭觉县阿土列尔村，“悬崖上的村”；三条路中两条悬崖路，一条水路路程远且只能在枯水期走三个月。两条悬崖路是藤梯路，支尓莫乡党委书记阿皮几体，这条路他已经往返了150多趟，第一次走这条路的时候，他一脚踩空，是老乡用肩膀顶起了他，捡回了一条命。目前阿土列尔村三分之二的人已经脱贫。<br>\
<br>\
<br>\
5.陇南市-致贫原因<br>\
<br>\
致贫原因：<br>\
交通不便、 信息闭塞<br>\
<br>\
<br>\
6.陇南市-脱贫方式<br>\
<br>\
脱贫方式<br>\
电商扶贫，教育培训，基础设施完善，开办网店<br>\
<br>\
<br>\
7.陇南市-今昔对比<br>\
<br>\
今昔对比<br>\
道路硬化率提高，网络覆盖率提高，青年劳动力返乡创业，经济逐渐发展<br>\
<br>\
<br>\
8.陇南市-优秀事迹<br>\
<br>\
优秀事迹<br>\
通过网店带动、电 商产业带动、电商创业带动、电商就业带动和电 商入股带动，促进电商和精准扶贫深度融合。到 2016年底，全市共发展网店超万家，两年网络 销售农产品64亿元，718万人实现就业。其中， 750个电商扶贫试点贫困村开办网店980家，带 动15万贫困人口增收。<br>\
<br>\
<br>\
9.十八洞村-致贫原因<br>\
<br>\
致贫原因<br>\
交通闭塞、极度贫困的深山苗寨，属高山容岩地区<br>\
<br>\
<br>\
10.十八洞村-脱贫方式<br>\
<br>\
脱贫方式<br>\
发展乡村旅游业、发展当地特色产业、改造基础设施<br>\
<br>\
<br>\
11.十八洞村-今昔对比<br>\
<br>\
今昔对比<br>\
劳动力返乡就业，旅游业发展，猕猴桃、刺绣产业发展、房屋修缮、道路交通方便，经济逐渐发展<br>\
<br>\
<br>\
12.十八洞村-优秀事迹<br>\
<br>\
优秀事迹<br>\
精准扶贫第一村。2013年11月3日，习近平总书记来到这里考察调研，首次提出了“精准扶贫”的重要思想。这个偏远的湘西村庄因此被世界关注，成为中国脱贫攻坚历程中的“地标”，也形成了扶贫的新“节点”。<br>\
<br>\
<br>\
13.下党村-致贫原因<br>\
<br>\
致贫原因<br>\
房屋简陋，基础设施相对滞后，通村道路差，无网络覆盖<br>\
<br>\
<br>\
14.下党村-脱贫方式<br>\
<br>\
脱贫原因<br>\
“扶贫定制茶园”， 因地制宜，开发传统产业 ，成立专业合作社<br>\
<br>\
<br>\
15.下党村-今昔对比<br>\
<br>\
优秀<br>\
年轻人返乡创业，有效利用当地资源，拓展就业和销售渠道，生活水平提高，人民精神面貌良好，经济逐渐发展<br>\
<br>\
<br>\
16.下党村-优秀事迹<br>\
<br>\
优秀事迹<br>\
第一书记曾守福和村两委班子的带领下，下党村因地制宜，紧紧抓住茶叶这一传统产业，通过 开发“扶贫定制荼园”增产增收，同时带动农家 乐发展，全村发生显著变化。2016年，全村有27户贫困户脱贫。村民人均可支配收入从2014年的4600元增长到11000元，村集体收入增长 到2016年的22.3万元。<br>\
<br>\
<br>\
"
//定义函数分割myData数据 , myData接收分好组的数据 :以三个连续的<br>\标记为分界

var d = myDataStr.split("<br><br><br>");   //以三个br分出不同大主题
for(var i=0 ;i< d.length;i++){
    var c = d[i].split("<br><br>");
    myData.push(
        {
            img:c[0].replace('.',"")+".jpg",
            caption:c[0].split('.')[1],
            desc:c[1]
        }
    )
}

